Repository: yuki-kimoto/mojolicious-guides-japanese
Catalog: Mojo-OmegaT-omegat.tmx
Source language: en
Languages: ja

source: L<Test::Mojo>'s L<Mojo::UserAgent> has access to a JSON parser, which allows us to test to see if a JSON response contains a value at a location in the document using JSON pointer syntax:
ja: [[Test::Mojo]]'s [[Mojo::UserAgent]] has access to a JSON parser, which allows us to test to see if a JSON response contains a value at a location in the document using JSON pointer syntax:

source: L<Test::Mojo>'s handling of HTTP redirects eliminates the need for making many, sometimes an unknown number, of redirections to keep testing precise and easy to follow (ahem).
ja: [[Test::Mojo]]'s handling of HTTP redirects eliminates the need for making many, sometimes an unknown number, of redirections to keep testing precise and easy to follow (ahem).

source: L<https://github.com/mojolicious/mojo>, L<Mojolicious::Guides>, L<https://mojolicious.org>.
ja: [[https://github.com/mojolicious/mojo]], [[Mojolicious::Guides]], [[https://mojolicious.org]].

source: Layouts can also be used with L<Mojolicious::Controller/"render_to_string">, but the C<layout> value needs to be passed as a render argument (not a stash value).
ja: Layouts can also be used with [[Mojolicious::Controller/"render_to_string"]], but the C<layout> value needs to be passed as a render argument (not a stash value).

source: Licensed under the Apache License, Version 2.0 L<http://www.apache.org/licenses/LICENSE-2.0>.
ja: Licensed under the Apache License, Version 2.0 [[http://www.apache.org/licenses/LICENSE-2.0]].

source: Licensed under the CC-SA License, Version 4.0 L<http://creativecommons.org/licenses/by-sa/4.0>.
ja: Licensed under the CC-SA License, Version 4.0 [[http://creativecommons.org/licenses/by-sa/4.0]].

source: Licensed under the MIT License, L<http://creativecommons.org/licenses/MIT>.
ja: Licensed under the MIT License, [[http://creativecommons.org/licenses/MIT]].

source: Like the technical community as a whole, the L<Mojolicious> team and community is made up of a mixture of professionals and volunteers from all over the world, working on every aspect of the mission - including mentorship, teaching, and connecting people.
ja: Like the technical community as a whole, the [[Mojolicious]] team and community is made up of a mixture of professionals and volunteers from all over the world, working on every aspect of the mission - including mentorship, teaching, and connecting people.

source: List all files in the directory and return a L<Mojo::Collection> object containing the results as L<Mojo::File> objects.
ja: List all files in the directory and return a [[Mojo::Collection]] object containing the results as [[Mojo::File]] objects.

source: List all files recursively in the directory and return a L<Mojo::Collection> object containing the results as L<Mojo::File> objects.
ja: List all files recursively in the directory and return a [[Mojo::Collection]] object containing the results as [[Mojo::File]] objects.

source: Listen backlog size, defaults to the value of L<Mojo::Server::Daemon/"backlog">.
ja: Listen backlog size, defaults to the value of [[Mojo::Server::Daemon/"backlog"]].

source: Literal names will be translated to and from L<Mojo::JSON> constants or a similar native Perl value.
ja: Literal names will be translated to and from [[Mojo::JSON]] constants or a similar native Perl value.

source: Load a class and catch exceptions, returns a false value if loading was successful, a true value if the class was not found, or a L<Mojo::Exception> object if loading failed.
ja: Load a class and catch exceptions, returns a false value if loading was successful, a true value if the class was not found, or a [[Mojo::Exception]] object if loading failed.

source: Load a plugin with L<Mojolicious/"plugin">.
ja: Load a plugin with [[Mojolicious/"plugin"]].

source: Load a plugin, for a full list of example plugins included in the L<Mojolicious> distribution see L<Mojolicious::Plugins/"PLUGINS">.
ja: Load a plugin, for a full list of example plugins included in the [[Mojolicious]] distribution see [[Mojolicious::Plugins/"PLUGINS"]].

source: Load application from script and assign it to L</"app">.
ja: Load application from script and assign it to [[/"app"]].

source: Loads configuration file and passes the content to L</"parse">.
ja: Loads configuration file and passes the content to [[/"parse"]].

source: Log file path used by L</"handle">.
ja: Log file path used by [[/"handle"]].

source: Log filehandle used by default L</"message"> event, defaults to opening L</"path"> or C<STDERR>.
ja: Log filehandle used by default [[/"message"]] event, defaults to opening [[/"path"]] or C<STDERR>.

source: Low-level event reactor, defaults to the C<reactor> attribute value of the global L<Mojo::IOLoop> singleton.
ja: Low-level event reactor, defaults to the C<reactor> attribute value of the global [[Mojo::IOLoop]] singleton.

source: Low-level event reactor, usually a L<Mojo::Reactor::Poll> or L<Mojo::Reactor::EV> object with a default subscriber to the event L<Mojo::Reactor/"error">.
ja: Low-level event reactor, usually a [[Mojo::Reactor::Poll]] or [[Mojo::Reactor::EV]] object with a default subscriber to the event [[Mojo::Reactor/"error"]].

source: Low-level generator for routes matching all HTTP request methods, returns a L<Mojolicious::Routes::Route> object.
ja: Low-level generator for routes matching all HTTP request methods, returns a [[Mojolicious::Routes::Route]] object.

source: MIME type mappings can be extended or changed easily with L<Mojolicious/"types">.
ja: MIMEタイプのマッピングは、[[Mojolicious]]のC<types>によって拡張したり、変更したりすることができます。

source: Many configuration settings can be tweaked right from within your application with L<Mojolicious/"config">, for a full list see L<Mojo::Server::Hypnotoad/"SETTINGS">.
ja: Many configuration settings can be tweaked right from within your application with [[Mojolicious/"config"]], for a full list see [[Mojo::Server::Hypnotoad/"SETTINGS"]].

source: Many different L<commands|Mojolicious::Commands/"COMMANDS"> are automatically available from the command line.
ja: 多くの[[commands|Mojolicious::Commands]] が自動的にコマンドラインから利用できるようになります。

source: Match controller and options against L</"root"> to find an appropriate L</"endpoint">.
ja: Match controller and options against [[/"root"]] to find an appropriate [[/"endpoint"]].

source: Match routes with L</"match"> and dispatch with L</"continue">.
ja: Match routes with [[/"match"]] and dispatch with [[/"continue"]].

source: Match routes with L<Mojolicious::Routes::Match>.
ja: Match routes with [[Mojolicious::Routes::Match]].

source: Maximum amount of time in seconds a connection can be inactive before getting closed, defaults to the value of L<Mojo::Server::Daemon/"inactivity_timeout">.
ja: Maximum amount of time in seconds a connection can be inactive before getting closed, defaults to the value of [[Mojo::Server::Daemon/"inactivity_timeout"]].

source: Maximum amount of time in seconds before a worker without a heartbeat will be stopped gracefully, defaults to the value of L<Mojo::Server::Prefork/"heartbeat_timeout">.
ja: Maximum amount of time in seconds before a worker without a heartbeat will be stopped gracefully, defaults to the value of [[Mojo::Server::Prefork/"heartbeat_timeout"]].

source: Maximum amount of time in seconds stopping a worker gracefully may take before being forced, defaults to the value of L<Mojo::Server::Prefork/"graceful_timeout">.
ja: Maximum amount of time in seconds stopping a worker gracefully may take before being forced, defaults to the value of [[Mojo::Server::Prefork/"graceful_timeout"]].

source: Maximum number of accepted connections each worker process is allowed to handle concurrently, before stopping to accept new incoming connections, defaults to the value of L<Mojo::IOLoop/"max_connections">.
ja: Maximum number of accepted connections each worker process is allowed to handle concurrently, before stopping to accept new incoming connections, defaults to the value of [[Mojo::IOLoop/"max_connections"]].

source: Maximum number of accepted connections this server is allowed to handle concurrently, before stopping to accept new incoming connections, passed along to L<Mojo::IOLoop/"max_connections">.
ja: Maximum number of accepted connections this server is allowed to handle concurrently, before stopping to accept new incoming connections, passed along to [[Mojo::IOLoop/"max_connections"]].

source: Maximum number of connections a worker is allowed to accept, before stopping gracefully and then getting replaced with a newly started worker, defaults to the value of L<Mojo::Server::Prefork/"accepts">.
ja: Maximum number of connections a worker is allowed to accept, before stopping gracefully and then getting replaced with a newly started worker, defaults to the value of [[Mojo::Server::Prefork/"accepts"]].

source: Maximum number of connections a worker is allowed to accept, before stopping gracefully and then getting replaced with a newly started worker, passed along to L<Mojo::IOLoop/"max_accepts">, defaults to C<10000>.
ja: Maximum number of connections a worker is allowed to accept, before stopping gracefully and then getting replaced with a newly started worker, passed along to [[Mojo::IOLoop/"max_accepts"]], defaults to C<10000>.

source: Maximum number of logged messages to store in L</"history">, defaults to C<10>.
ja: Maximum number of logged messages to store in [[/"history"]], defaults to C<10>.

source: Maximum request size in bytes, defaults to the value of L<Mojo::Message/"max_message_size">.
ja: Maximum request size in bytes, defaults to the value of [[Mojo::Message/"max_message_size"]].

source: Maximum response size in bytes, defaults to the value of L<Mojo::Message::Response/"max_message_size">.
ja: Maximum response size in bytes, defaults to the value of [[Mojo::Message::Response/"max_message_size"]].

source: Maximum size in bytes of data to keep in memory before automatically upgrading to a L<Mojo::Asset::File> object, defaults to the value of the C<MOJO_MAX_MEMORY_SIZE> environment variable or C<262144> (256KiB).
ja: Maximum size in bytes of data to keep in memory before automatically upgrading to a [[Mojo::Asset::File]] object, defaults to the value of the C<MOJO_MAX_MEMORY_SIZE> environment variable or C<262144> (256KiB).

source: Maybe you would prefer a different template system than C<ep>, which is provided by L<Mojolicious::Plugin::EPRenderer>, and there is not already a plugin on CPAN for your favorite one.
ja: Maybe you would prefer a different template system than C<ep>, which is provided by [[Mojolicious::Plugin::EPRenderer]], and there is not already a plugin on CPAN for your favorite one.

source: Members of the L<Mojolicious> community should be respectful when dealing with other members as well as with people outside the L<Mojolicious> community.
ja: Members of the [[Mojolicious]] community should be respectful when dealing with other members as well as with people outside the [[Mojolicious]] community.

source: Message content, defaults to a L<Mojo::Content::Single> object.
ja: Message content, defaults to a [[Mojo::Content::Single]] object.

source: Message headers, usually a L<Mojo::Headers> object.
ja: Message headers, usually a [[Mojo::Headers]] object.

source: Mode changes also affect a few other aspects of the framework, such as the built-in C<exception> and C<not_found> pages.
ja: モードの変更は、C<exception>やC<not_found>テンプレートなどのフレームワークのその他の面に影響します。

source: Mojo - Web development toolkit
ja: Mojo - Web開発ツールキット

source: Mojolicious::Guides::Tutorial - Get started with Mojolicious
ja: Mojolicious::Guides::Tutorial - Mojoliciousをはじめよう

source: Moniker of this application, often used as default filename for configuration files and the like, defaults to decamelizing the application class with L<Mojo::Util/"decamelize">.
ja: Moniker of this application, often used as default filename for configuration files and the like, defaults to decamelizing the application class with [[Mojo::Util/"decamelize"]].

source: Most commonly used features every L<Mojolicious> developer should know about.
ja: Most commonly used features every [[Mojolicious]] developer should know about.

source: Most response content, static as well as dynamic, gets served through L<Mojo::Asset::File> and L<Mojo::Asset::Memory> objects.
ja: Most response content, static as well as dynamic, gets served through [[Mojo::Asset::File]] and [[Mojo::Asset::Memory]] objects.

source: Mount L<Mojolicious> application and return the generated route, which is usually a L<Mojolicious::Routes::Route> object.
ja: Mount [[Mojolicious]] application and return the generated route, which is usually a [[Mojolicious::Routes::Route]] object.

source: Mount whole L<Mojolicious> applications.
ja: Mount whole [[Mojolicious]] applications.

source: Move asset data into a specific file and disable L</"cleanup">.
ja: Move asset data into a specific file and disable [[/"cleanup"]].

source: Move file with L<File::Copy> and return the destination as a L<Mojo::File> object.
ja: Move file with [[File::Copy]] and return the destination as a [[Mojo::File]] object.

source: Much of L<Mojolicious> was developed using TDD.
ja: Much of [[Mojolicious]] was developed using TDD.

source: Multiple non-blocking operations, such as concurrent requests, can be easily synchronized with promises and L<Mojo::Promise/"all">.
ja: Multiple non-blocking operations, such as concurrent requests, can be easily synchronized with promises and [[Mojo::Promise/"all"]].

source: Must be called by the subprocess and emits the L</"progress"> event in the parent process with the data.
ja: Must be called by the subprocess and emits the [[/"progress"]] event in the parent process with the data.

source: Nameless routes get an automatically generated one assigned that is simply equal to the route itself without non-word characters.
ja: 名前がないルートには、自動生成されたルート名が割り当てられます。この名前は、ルート自身の名前からノンワード文字を除いたものと同じです。

source: Namespaces to load plugins from, defaults to L<Mojolicious::Plugin>.
ja: Namespaces to load plugins from, defaults to [[Mojolicious::Plugin]].

source: Namespaces to search for available generator commands, defaults to L<Mojolicious::Command::Author::generate>.
ja: Namespaces to search for available generator commands, defaults to [[Mojolicious::Command::Author::generate]].

source: Naming your routes will allow backreferencing in many methods and helpers throughout the whole framework, most of which internally rely on L<Mojolicious::Controller/"url_for"> for this.
ja: Naming your routes will allow backreferencing in many methods and helpers throughout the whole framework, most of which internally rely on [[Mojolicious::Controller/"url_for"]] for this.

source: No, you can't, L<Hypnotoad|Mojo::Server::Hypnotoad> is a bit special in this regard.
ja: No, you can't, [[Hypnotoad|Mojo::Server::Hypnotoad]] is a bit special in this regard.

source: Non-persistent data storage and exchange for the current request, application wide default values can be set with L<Mojolicious/"defaults">.
ja: Non-persistent data storage and exchange for the current request, application wide default values can be set with [[Mojolicious/"defaults"]].

source: Normalized version of L</"host"> and L</"port">.
ja: Normalized version of [[/"host"]] and [[/"port"]].

source: Normalized version of L</"path"> and L</"query">.
ja: Normalized version of [[/"path"]] and [[/"query"]].

source: Normalized version of L</"scheme">.
ja: Normalized version of [[/"scheme"]].

source: Note that L<Mojo::DOM::CSS> is not stateful, therefore C<:link> and C<:visited> yield exactly the same results.
ja: Note that [[Mojo::DOM::CSS> is not stateful, therefore C<:link]] and C<:visited> yield exactly the same results.

source: Note that extra files are only served if no better alternative could be found in L</"paths"> and L</"classes">.
ja: Note that extra files are only served if no better alternative could be found in [[/"paths"]] and [[/"classes"]].

source: Note that this attribute is EXPERIMENTAL because even though most commonly used browsers support the feature, there is no specification yet besides L<this draft|https://tools.ietf.org/html/draft-west-first-party-cookies-07>.
ja: Note that this attribute is EXPERIMENTAL because even though most commonly used browsers support the feature, there is no specification yet besides [[this draft|https://tools.ietf.org/html/draft-west-first-party-cookies-07]].

source: Note that L</"userinfo"> will not be included for security reasons.
ja: Note that [[/"userinfo"]] will not be included for security reasons.

source: Note that Perl versions 5.10.x and 5.12.x are known to work very poorly with L<Mojolicious>, and we strongly suggest you do not use them, to avoid stability and security issues.
ja: Note that Perl versions 5.10.x and 5.12.x are known to work very poorly with [[Mojolicious]], and we strongly suggest you do not use them, to avoid stability and security issues.

source: Note that TLS support depends on L<IO::Socket::SSL> (2.009+).
ja: Note that TLS support depends on [[IO::Socket::SSL]] (2.009+).

source: Note that for templates to be detected, these classes need to have already been loaded and added before L</"warmup"> is called, which usually happens automatically during application startup.
ja: Note that for templates to be detected, these classes need to have already been loaded and added before [[/"warmup"]] is called, which usually happens automatically during application startup.

source: Note that for files to be detected, these classes need to have already been loaded and added before L</"warmup"> is called, which usually happens automatically during application startup.
ja: Note that for files to be detected, these classes need to have already been loaded and added before [[/"warmup"]] is called, which usually happens automatically during application startup.

source: Note that high concurrency works best with applications that perform mostly non-blocking operations, to optimize for blocking operations you can decrease this value and increase L</"workers"> instead for better performance.
ja: Note that high concurrency works best with applications that perform mostly non-blocking operations, to optimize for blocking operations you can decrease this value and increase [[/"workers"]] instead for better performance.

source: Note that increasing this value can also drastically increase memory usage, should you for example attempt to parse an excessively large request body with the methods L<Mojo::Message/"dom"> or L<Mojo::Message/"json">.
ja: Note that increasing this value can also drastically increase memory usage, should you for example attempt to parse an excessively large request body with the methods [[Mojo::Message/"dom"]] or [[Mojo::Message/"json"]].

source: Note that increasing this value can also drastically increase memory usage, should you for example attempt to parse an excessively large response body with the methods L<Mojo::Message/"dom"> or L<Mojo::Message/"json">.
ja: Note that increasing this value can also drastically increase memory usage, should you for example attempt to parse an excessively large response body with the methods [[Mojo::Message/"dom"]] or [[Mojo::Message/"json"]].

source: Note that many renderers such as L<Mojolicious::Plugin::EPRenderer> also use this value to determine if template files should be decoded before processing.
ja: Note that many renderers such as [[Mojolicious::Plugin::EPRenderer]] also use this value to determine if template files should be decoded before processing.

source: Note that many real-time web features are based on the L<Mojo::IOLoop> event loop, and therefore require one of the built-in web servers to be able to use them to their full potential.
ja: Note that many real-time web features are based on the [[Mojo::IOLoop]] event loop, and therefore require one of the built-in web servers to be able to use them to their full potential.

source: Note that non-blocking name resolution depends on L<Net::DNS::Native> (0.15+), SOCKS5 support on L<IO::Socket::Socks> (0.64), and TLS support on L<IO::Socket::SSL> (2.009+).
ja: Note that non-blocking name resolution depends on [[Net::DNS::Native]] (0.15+), SOCKS5 support on [[IO::Socket::Socks]] (0.64), and TLS support on [[IO::Socket::SSL]] (2.009+).

source: Note that role support depends on L<Role::Tiny> (2.000001+).
ja: Note that role support depends on [[Role::Tiny]] (2.000001+).

source: Note that you should use custom L<Mojolicious/"secrets"> to make signed cookies really tamper resistant.
ja: 署名付き(signed)クッキーを本当に改ざんできなくするには、[[Mojolicious]]のC<secret>をカスタムして使用してください。

source: Number of keep-alive requests per connection, defaults to the value of L<Mojo::Server::Daemon/"max_requests">.
ja: Number of keep-alive requests per connection, defaults to the value of [[Mojo::Server::Daemon/"max_requests"]].

source: Number of worker processes, defaults to the value of L<Mojo::Server::Prefork/"workers">.
ja: Number of worker processes, defaults to the value of [[Mojo::Server::Prefork/"workers"]].

source: Of course these plugins can contain more than just helpers, take a look at L<Mojolicious::Plugins/"PLUGINS"> for a few ideas.
ja: Of course these plugins can contain more than just helpers, take a look at [[Mojolicious::Plugins/"PLUGINS"]] for a few ideas.

source: On Perl 5.20+ you can also append a C<-signatures> flag to all three forms and enable support for L<subroutine signatures|perlsub/"Signatures">.
ja: On Perl 5.20+ you can also append a C<-signatures> flag to all three forms and enable support for [[subroutine signatures|perlsub/"Signatures"]].

source: On Perl 5.20+ you can also use a C<-signatures> flag to enable support for L<subroutine signatures|perlsub/"Signatures">.
ja: On Perl 5.20+ you can also use a C<-signatures> flag to enable support for [[subroutine signatures|perlsub/"Signatures"]].

source: On UNIX platforms you can also add pre-forking to the built-in web server and switch to a multi-process architecture with L<Mojolicious::Command::prefork>, to take advantage of multiple CPU cores and copy-on-write memory management.
ja: On UNIX platforms you can also add pre-forking to the built-in web server and switch to a multi-process architecture with [[Mojolicious::Command::prefork]], to take advantage of multiple CPU cores and copy-on-write memory management.

source: Once the request has been received by the web server through the event loop, it will be passed on to L<Mojolicious>, where it will be handled in a few simple steps.
ja: Once the request has been received by the web server through the event loop, it will be passed on to [[Mojolicious]], where it will be handled in a few simple steps.

source: Once the tests have completed, the L<Mojolicious> application will be torn down.
ja: Once the tests have completed, the [[Mojolicious]] application will be torn down.

source: Once you switch modes from C<development> to C<production>, no sensitive information will be revealed on those pages anymore.
ja: モードをC<development>からC<production>に切り替えると 、例外ページに機密情報が表示されなくなります。

source: One interesting thing of note: the return value of L<Test::Mojo> object assertions is always the test object itself, allowing us to "chain" test assertion methods.
ja: One interesting thing of note: the return value of [[Test::Mojo]] object assertions is always the test object itself, allowing us to "chain" test assertion methods.

source: One nice feature of L<Test::Mojo> is its ability to pass configuration values directly from its constructor.
ja: One nice feature of [[Test::Mojo]] is its ability to pass configuration values directly from its constructor.
